tap "homebrew/bundle"
tap "anomalyco/tap"

# CLI ツール
# telnet: nixpkgs の inetutils は Darwin 向けビルドが不安定なため homebrew で管理
brew "mas"
brew "telnet"
brew "anomalyco/tap/opencode"

# ターミナル
cask "ghostty"

# 仮想化
cask "rancher"

# 開発ツール
cask "copilot-cli"
cask "visual-studio-code"

# ブラウザ
cask "firefox"
cask "google-chrome"
cask "google-chrome@beta"
cask "microsoft-edge"

# コミュニケーション
cask "discord"
cask "slack"

# 生産性
cask "notion"
cask "1password"

# ハードウェア
cask "logi-options+"
cask "karabiner-elements"

# フォント
cask "font-hackgen-nerd"
cask "font-noto-nerd-font"

# クラウド CLI
# nixpkgs の更新が追いつかないため homebrew で管理
cask "gcloud-cli"

# Mac App Store
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
