tap "homebrew/bundle"

# ターミナル
cask "ghostty"

# 仮想化
cask "rancher"

# 開発ツール
cask "visual-studio-code"

# ブラウザ
cask "firefox"
cask "firefox@beta"
cask "google-chrome"
cask "google-chrome@beta"
cask "microsoft-edge"

# コミュニケーション
cask "discord"
cask "slack"

# 生産性
cask "notion"
cask "1password"

# ハードウェア
cask "logi-options+"
cask "karabiner-elements"

# フォント
cask "font-hackgen-nerd"
cask "font-noto-nerd-font"

# クラウド CLI
# nixpkgs の更新が追いつかないため homebrew で管理
cask "google-cloud-sdk"
